{"title":"Marine Species Detection by YOLOv7","uid":"face3408614c8be8a20074e340a7f463","slug":"Marine Species Detection by YOLOv7","date":"2022-09-27T09:19:05.000Z","updated":"2022-09-27T03:42:01.987Z","comments":true,"path":"api/articles/Marine Species Detection by YOLOv7.json","keywords":null,"cover":"https://s1.ax1x.com/2022/09/27/xZtB01.png","content":"<h1 id=\"Marine-Species-Detection-by-YOLOv7\"><a href=\"#Marine-Species-Detection-by-YOLOv7\" class=\"headerlink\" title=\"Marine Species Detection by YOLOv7\"></a>Marine Species Detection by YOLOv7</h1><h2 id=\"Project-Overview\"><a href=\"#Project-Overview\" class=\"headerlink\" title=\"Project Overview\"></a>Project Overview</h2><p>With the rapid development of deep learning in marine biological testing, its status in marine ecological testing and resource development continues to increase.  The development of marine ecological monitoring and other aspects is of great importance. Deep learning has an extraordinary effect on target detection.</p>\n<p>Traditional Marine biological object detection methods need to manually screen and extract features of the object, which lead to problems such as large time consumption and calculation redundancy. In 2019, a labeling-efficient method of training a CNN-based fish detector was presented by Dmitry A. Konovalov et al. This method verified the feasibility of the deep learning detection algorithm. </p>\n<p>As a novel object detection algorithm, YOLOv7 has significant advantages in object detection in the complex marine environment and will have greater improvement in the identification accuracy of marine organisms.</p>\n<p>Using YOLOv7, we plan to select and train an appropriate model to recognize thousands of marine lives at a relatively high accuracy rate, which may enable humans to protect endangered species or even discover a new species.</p>\n<h2 id=\"Project-Background\"><a href=\"#Project-Background\" class=\"headerlink\" title=\"Project Background\"></a>Project Background</h2><p>YOLOv7 is a novel object detection algorithm. It has great advantages for target detection in complex Marine environment, and the recognition accuracy of Marine organisms will be greatly improved.</p>\n<p>Biologists and conservationists can use YOLOV7 to make reasonable estimates of the status of biological populations and the quality of the environment based on photographs taken by cameras on the ocean floor. Therefore, necessary measures can be taken promptly. More generally, the target of the algorithm can not only be Marine organisms. Strictly speaking, any target that requires human recognition can be applied to the algorithm, thus saving a lot of resources. This has been demonstrated by many pieces of literature.</p>\n<p>According to the work of Wang and his colleagues, YOLOv7 achieves impressive results compared to other real-time detectors. In order to further improve the YOLOv7 algorithm, our project hopes to reduce the computational cost while improving its recognition accuracy to a certain extent. In a broader sense, the immediate aim of this project is Marine biometrics.</p>\n<h2 id=\"Challenges-amp-Solutions\"><a href=\"#Challenges-amp-Solutions\" class=\"headerlink\" title=\"Challenges &amp; Solutions\"></a>Challenges &amp; Solutions</h2><h3 id=\"Challenges-on-the-dataset\"><a href=\"#Challenges-on-the-dataset\" class=\"headerlink\" title=\"Challenges on the dataset\"></a>Challenges on the dataset</h3><p>Generally, this project has two main factors, dataset, and algorithm. For the dataset, we need to find one with YOLO form, which contains pictures of all species that we want to detect. In this part, the challenges we encountered are that it is hard for us to find pictures that are clear and suitable. We started with a dataset on Kaggle, which is the Aquarium dataset. It contains 7 classes, fish, stingray, jellyfish, penguin, shark, puffin, and starfish. The problem occurred that after we trained the dataset by YOLOv7, the accuracy of the recognition of some species like puffin and shark are relatively low among all the species. According to the work of Mateusz Buda et al, the performance could be increased if the data distribution is unbiased. To solve the long tail problem, we need to form unbiased data, which is another challenge. Since the pictures of some species are hard to find, we decide to use an algorithm by Golnaz Ghiasi et al, we do segmentation on the target and paste the target on another background, which generates a new picture so that we could have the same amount of the species in the dataset. Many datasets of Marine species are collected in the zoo or aquariums, so the species are not 100% the same as those in the wild. So we try to find some live cameras in the wild to find some pictures of marine species in the wild and use them as a part of our dataset. One thing that is a huge challenge is that there aren’t always some marine species in the camera and the classes of the species are far more than we expected. So we just choose some classical pictures and then we combine some species into one class so that it would be easier to train.</p>\n<h3 id=\"Challenges-on-the-models\"><a href=\"#Challenges-on-the-models\" class=\"headerlink\" title=\"Challenges on the models\"></a>Challenges on the models</h3><p>In the work of building models, we have tried five different models to train our dataset, during which we met the problem of low precision of some species and overall unsteady accuracy. In our first version of program, we chose original YOLOv7 to train our dataset, whose network structure shows in Figure 1. After training this model, we found the problems mentioned above in the dataset. Besides the problem of dataset, we thought this was caused by the structure of model. In the work of Wang et al, they designed basic model for edge GPU, normal GPU, and cloud GPU, and they are respectively called YOLOv7-tiny, YOLOv7, and YOLOv7-W6. For YOLOv7, they did stack scaling on neck, and the proposed compound scaling method to perform scaling-up of the depth and width of the entire model, and used this to obtain YOLOv7-X, which performs better than YOLOv7. So we chose YOLOv7-X to train our new data augmented by copy-and-paste method. In the second model, we decided to change some parameters, and it led to a worse performance.</p>\n<p><a href=\"https://imgse.com/i/xZJHVP\"><img src=\"https://s1.ax1x.com/2022/09/27/xZJHVP.png\" alt=\"xZJHVP.png\"></a></p>\n<p>We thought the low image size our inchoate idea of choosing models might be wrong. So we started our third version, in which we chose YOLOv7-W6 model which performs well on cloud GPU and set a higher image size. Finally we obtained a great model performs well in all species which has solved the problem of low precision in Puffin and Shark.</p>\n<p><a href=\"https://imgse.com/i/xZYCV0\"><img src=\"https://s1.ax1x.com/2022/09/27/xZYCV0.png\" alt=\"xZYCV0.png\"></a></p>\n<h2 id=\"Contributions-of-Marine-Species-Detection-by-YOLOv7\"><a href=\"#Contributions-of-Marine-Species-Detection-by-YOLOv7\" class=\"headerlink\" title=\"Contributions of Marine Species Detection by YOLOv7\"></a>Contributions of Marine Species Detection by YOLOv7</h2><p>The advent of YOLOv7 is of great significance. It surpassed all the real-time detectors of its time and has had an immeasurable impact on the related fields. And our project applies it to Marine organism detection, which makes considerable contributions. </p>\n<h3 id=\"Contributions-to-YOLOv7-itself\"><a href=\"#Contributions-to-YOLOv7-itself\" class=\"headerlink\" title=\"Contributions to YOLOv7 itself\"></a>Contributions to YOLOv7 itself</h3><p>The data set used by the initial YOLOv7 algorithm is without any bias, that is, the data will not be uniformly distributed, which is also in line with the distribution of natural data. However, according to the work of Mateusz Buda et al, the training effect of the model is greatly limited when the data distribution is not uniform. This is also intuitively easy to understand: given 80% of class A data and 20% of class B data, A classifier must be much better at identifying class A than it is at identifying class B.</p>\n<p>To solve this problem, one of the most intuitive ideas is to augment the dataset. However, collecting and labeling large amounts of data just to improve performance by a few percentage points does not pay off. Inspired by the work of Golnaz Ghiasi et al, we Copy and Paste the dataset. Here copy means doing segmentation on the original dataset to extract the target we want to do detection. And paste means simply pasting the target randomly on the background to increase the number of the target. In this way, we enhance the data without introducing external data, thus improving the performance of YOLOv7.</p>\n<h3 id=\"Contributions-to-marine-biology\"><a href=\"#Contributions-to-marine-biology\" class=\"headerlink\" title=\"Contributions to marine biology\"></a>Contributions to marine biology</h3><p>In recent years, marine resources have become the focus of development and utilization of resources. How to accurately identify underwater organisms becomes more and more important. The application of YOLOv7 algorithm to marine biological identification can have significant application in related fields.</p>\n<p>Mao Guojun and his colleagues improved the YOLOV4 algorithm by introducing the concept of a cross-stage local network, building an Embedded Connection component and embedding it at the end of the YOLOV4 network. The mAP of the improved algorithm is improved by 4.8% . In addition, it is worth noting that H. Fan first used YOLOv5 in marine biological object detection in 2021, who overcame the problem of low detection accuracy.</p>\n<p><a href=\"https://imgse.com/i/xZYRZq\"><img src=\"https://s1.ax1x.com/2022/09/27/xZYRZq.png\" alt=\"xZYRZq.png\"></a></p>\n<p>Therefore, we firmly believe that if we can put our project into practice, biologists and environmentalists can use this algorithm to make reasonable estimates of biological population status and environmental quality based on the pictures taken by the seabed camera. So far, we’ve been able to use the YOLOv7 on Live Camera to detect the number and location of creatures.</p>\n<p><a href=\"https://imgse.com/i/xZYWd0\"><img src=\"https://s1.ax1x.com/2022/09/27/xZYWd0.png\" alt=\"xZYWd0.png\"></a></p>\n<h3 id=\"Contributions-to-target-detection-tasks\"><a href=\"#Contributions-to-target-detection-tasks\" class=\"headerlink\" title=\"Contributions to target detection tasks\"></a>Contributions to target detection tasks</h3><p>More generally, the target of our project can not only be marine life. Marine species detection(MSD) can be extended to universal target detection(UTD). Actually, what our project has really accomplished is the improvement and modification of the core algorithm, and the Marine biological target is just a carrier for performance. To be strict, any target that requires human recognition can be applied to the algorithm, thus saving a lot of resources.</p>\n<p>For example, the improved YOLOv7 algorithm can be used for surface defect detection of aero-engine parts, and compared with Faster R-CNN and other algorithms, YOLOv7 has high accuracy and small volume. Another example is in the field of transportation, where the YOLO algorithm is used for infrared vehicle image detection.</p>\n<p>In conclusion, chances are that whether it is for the narrow sense of the YOLO algorithm itself, or standard marine species detection, or more broadly, target recognition, our project will make a significant contribution.</p>\n<h2 id=\"Bibliography\"><a href=\"#Bibliography\" class=\"headerlink\" title=\"Bibliography\"></a>Bibliography</h2><p>[1] Liu, Shasha et al. (2018). “Embedded online fish detection and tracking system via YOLOv3 and parallel correlation filter”. In: OCEANS 2018 MTS/IEEE Charleston. IEEE, pp. 1–6.<br>[2] Fan, Haodong, Daqi Zhu, and Yuhang Li (2021). “An Improved Yolov5 Marine Biological Object Detection Algorithm”. In: 2021 2nd International Conference on Artificial Intelligence and Computer Engineering (ICAICE). IEEE, pp. 29–34.<br>[3] Konovalov, Dmitry A et al. (2019). “Underwater fish detection with weak multidomain supervision”. In: 2019 International Joint Conference on Neural Networks (IJCNN). IEEE, pp. 1–8.<br>[4] Wang, ChienYao, Alexey Bochkovskiy, and HongYuan Mark Liao (July 2022). “YOLOv7: Trainable bagoffreebies sets new stateoftheart for realtime object detectors”. In: arXiv eprints , arXiv:2207.02696, arXiv:2207.02696. arXiv: 2207.02696 [cs.CV].<br>[5] Buda, Mateusz, Atsuto Maki, and Maciej A Mazurowski (2018). “A systematic study of the class imbalance problem in convolutional neural networks”. In: Neural networks 106, pp. 249–259.<br>[6] Ghiasi, Golnaz et al. (2021). “Simple copypaste is a strong data augmentation method for instance segmentation”. In: Proceedings of the IEEE/CVF Conference on Computer Vision and Pattern Recognition, pp. 2918–2928.<br>[7] Mao, G et al. (2021). “Model for marine organism detection in shallow sea using the improved YOLOV4 network”. In: Trans. Chin. Soc. Agric. Eng 37, pp. 152–158.<br>[8] Fan, Youchen et al. (2022). “Application of Improved YOLOv5 in Aerial Photographing Infrared Vehicle Detection”. In: Electronics 11.15, p. 2344.<br>[9] Li, Xin et al. (2022). “Surface Defect Detection Model for AeroEngine Components Based on Improved YOLOv5”. In: Applied Sciences 12.14, p. 7235. 7</p>\n","feature":true,"text":"Marine Species Detection by YOLOv7Project OverviewWith the rapid development of deep learning in marine biological testing, its status in ma...","link":"","photos":[],"count_time":{"symbolsCount":"11k","symbolsTime":"10 mins."},"categories":[{"name":"Artificial Intelligence","slug":"Artificial-Intelligence","count":2,"path":"api/categories/Artificial-Intelligence.json"}],"tags":[{"name":"Artificial Intelligence","slug":"Artificial-Intelligence","count":2,"path":"api/tags/Artificial-Intelligence.json"}],"toc":"<ol class=\"toc\"><li class=\"toc-item toc-level-1\"><a class=\"toc-link\" href=\"#Marine-Species-Detection-by-YOLOv7\"><span class=\"toc-text\">Marine Species Detection by YOLOv7</span></a><ol class=\"toc-child\"><li class=\"toc-item toc-level-2\"><a class=\"toc-link\" href=\"#Project-Overview\"><span class=\"toc-text\">Project Overview</span></a></li><li class=\"toc-item toc-level-2\"><a class=\"toc-link\" href=\"#Project-Background\"><span class=\"toc-text\">Project Background</span></a></li><li class=\"toc-item toc-level-2\"><a class=\"toc-link\" href=\"#Challenges-amp-Solutions\"><span class=\"toc-text\">Challenges &amp; Solutions</span></a><ol class=\"toc-child\"><li class=\"toc-item toc-level-3\"><a class=\"toc-link\" href=\"#Challenges-on-the-dataset\"><span class=\"toc-text\">Challenges on the dataset</span></a></li><li class=\"toc-item toc-level-3\"><a class=\"toc-link\" href=\"#Challenges-on-the-models\"><span class=\"toc-text\">Challenges on the models</span></a></li></ol></li><li class=\"toc-item toc-level-2\"><a class=\"toc-link\" href=\"#Contributions-of-Marine-Species-Detection-by-YOLOv7\"><span class=\"toc-text\">Contributions of Marine Species Detection by YOLOv7</span></a><ol class=\"toc-child\"><li class=\"toc-item toc-level-3\"><a class=\"toc-link\" href=\"#Contributions-to-YOLOv7-itself\"><span class=\"toc-text\">Contributions to YOLOv7 itself</span></a></li><li class=\"toc-item toc-level-3\"><a class=\"toc-link\" href=\"#Contributions-to-marine-biology\"><span class=\"toc-text\">Contributions to marine biology</span></a></li><li class=\"toc-item toc-level-3\"><a class=\"toc-link\" href=\"#Contributions-to-target-detection-tasks\"><span class=\"toc-text\">Contributions to target detection tasks</span></a></li></ol></li><li class=\"toc-item toc-level-2\"><a class=\"toc-link\" href=\"#Bibliography\"><span class=\"toc-text\">Bibliography</span></a></li></ol></li></ol>","author":{"name":"JerryYan","slug":"blog-author","avatar":"https://z3.ax1x.com/2021/12/01/oJTH4U.png","link":"/","description":"A student from CQU","socials":{"github":"https://github.com/JY-JOKE","twitter":"","stackoverflow":"","wechat":"","qq":"","weibo":"https://weibo.com/u/5584816151","zhihu":"","csdn":"https://blog.csdn.net/qq_29207457?spm=1000.2115.3001.5343","juejin":"","customs":{}}},"mapped":true,"prev_post":{},"next_post":{"title":"Face Recognition By PCA","uid":"d2a98f67e0657f2a5b8d1883d9cac0d0","slug":"Face Recognition By PCA","date":"2022-01-08T12:43:05.000Z","updated":"2022-01-08T14:02:01.105Z","comments":true,"path":"api/articles/Face Recognition By PCA.json","keywords":null,"cover":"https://s4.ax1x.com/2022/01/08/7iFbC9.jpg","text":"PCA​ PCA（Principal Component Analysis）是一种常用的数据分析方法。PCA通过线性变换将原始数据变换为一组各维度线性无关的表示，可用于提取数据的主要特征分量，常用于高维数据的降维。 ​ 统计学上PCA的定义为用几个较少的综合指标来代替原来较多的指...","link":"","photos":[],"count_time":{"symbolsCount":"8.6k","symbolsTime":"8 mins."},"categories":[{"name":"Artificial Intelligence","slug":"Artificial-Intelligence","count":2,"path":"api/categories/Artificial-Intelligence.json"}],"tags":[{"name":"Artificial Intelligence","slug":"Artificial-Intelligence","count":2,"path":"api/tags/Artificial-Intelligence.json"}],"author":{"name":"JerryYan","slug":"blog-author","avatar":"https://z3.ax1x.com/2021/12/01/oJTH4U.png","link":"/","description":"A student from CQU","socials":{"github":"https://github.com/JY-JOKE","twitter":"","stackoverflow":"","wechat":"","qq":"","weibo":"https://weibo.com/u/5584816151","zhihu":"","csdn":"https://blog.csdn.net/qq_29207457?spm=1000.2115.3001.5343","juejin":"","customs":{}}},"feature":true}}